------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\GitDir\Projects\ags_capital_vs_output/output/logs/proposal_ana
> lysis.txt
  log type:  text
 opened on:  14 Jul 2022, 09:10:46

. ****************************************************************************
> ****
. 
. set scheme s1color

. 
. ****************************************************************************
> ****
. * PREP DATA
. ****************************************************************************
> ****
. use "$repodir/generated_data/eia860_proposed_and_operating.dta",clear

. keep if has_wind == 1 // keep only wind plants
(18,386 observations deleted)

. drop if eia860_proposal_year==. // plants that show up in the 860 operating 
> data without ever showing up in the 860 proposed data
(425 observations deleted)

. drop if eia860_proposal_year>first_yr_oper & eia860_proposal_year!=. // drop
>  expansions to existing facilities (these data are at plant rather than gene
> rator level)
(93 observations deleted)

. drop if proposed_year<eia860_proposal_year // data issue that only affects f
> our plants from this subsample
(270 observations deleted)

. bys facilityid (eia860_proposal_year): keep if _n==1 // keep earliest propos
> al only
(590 observations deleted)

. 
. ****************************************************************************
> ****
. * SHARE EVER COMPLETED
. ****************************************************************************
> ****
. graph drop _all

. * share completed
. preserve

. drop if last_eia860_proposal_year==2016 & was_built==0
(171 observations deleted)

. collapse was_built, by(proposed_year)

. lab var was_built "Share of Plants Ever Completed"

. lab var proposed_year "Initial Expected Completion Year"

. keep if inrange(proposed_year,2004,2014)
(9 observations deleted)

. twoway scatter was_built proposed_year, ///
>         xline(2010.5, lwidth(40) lc(gs13)) ///
>         ysc(r(0 1)) ylab(0(0.2)1)

. graph export "$outdir/figures/proposal_data_ever_completed.png", replace
(file C:\GitDir\Projects\ags_capital_vs_output/output/figures/proposal_data_ev
> er_completed.png written in PNG format)

. restore

. 
. ****************************************************************************
> ****
. * SHARE COMPLETED NO LATER THAN ONE YEAR AFTER INTITIAL EXPECTED YEAR ONLINE
. ****************************************************************************
> ****
. * share completed
. preserve

. gen on_time = first_yr_oper-proposed_year<=1

. collapse on_time, by(proposed_year)

. lab var on_time "Share of Plants Completed by Expected Year+1"

. lab var proposed_year "Initial Expected Completion Year"

. keep if inrange(proposed_year,2004,2014)
(12 observations deleted)

. twoway scatter on_time proposed_year, ///
>         xline(2010.5, lwidth(40) lc(gs13)) ///
>         ysc(r(0 1)) ylab(0(0.2)1)

. graph export "$outdir/figures/proposal_data_completed_on_time.png", replace
(file C:\GitDir\Projects\ags_capital_vs_output/output/figures/proposal_data_co
> mpleted_on_time.png written in PNG format)

. restore

. 
. ****************************************************************************
> ****
. tempsetup
C:\GitDir\Projects\ags_capital_vs_output\temp

. capture log close
